app/views/potins/new.html.erb


      <%= select_tag 'tag', options_from_collection_for_select(Tag.all, :id, :title, selected = nil) %>
---
SELECT "tags".* FROM "tags"