app/views/potins/show.html.erb


  			<% if Comment.all.select{ |com| com.potin_id == params[:id].to_i } %>
  					<% Comment.all.select{ |com| com.potin_id == params[:id].to_i }.each do |c| %>
  						<p>Commentaire écrit par <%= User.find(c.user_id).first_name %> <%= User.find(c.user_id).last_name %> le <%= c.created_at.day %>-<%= c.created_at.month %>-<%= c.created_at.year %></p>
---
SELECT "comments".* FROM "comments"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]