app/views/users/new.html.erb


      Quelle est ta ville  ? <%= select_tag 'city_id', options_from_collection_for_select(City.all, :id, :name, selected = nil) %>
---
SELECT "cities".* FROM "cities"