app/views/pages/accueil.html.erb

	<% @potins.each do |p| %>
		<p>Auteur : <%= User.all.find(p.user_id).first_name%> / Titre : <%= p.title %> - <a href="/potins/<%= p.id%>" >Voir le potin</a></p>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  <div class="card-body text-dark">
    <h5 class="card-title">par <%= User.all.find(p.user_id).first_name%></h5>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]