app/helpers/sessions_helper.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
	def current_user
		if session[:id]
			current_user = User.find_by(id: session[:user_id])

UPDATE "users" SET "remember_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["remember_digest", nil], ["updated_at", "2020-10-30 23:02:03.068438"], ["id", 11]]
---
	def forget(user)
		user.update(remember_digest: nil)