app/controllers/cities_controller.rb

SELECT "cities".* FROM "cities"
---
  def index
  	@cities = City.all

SELECT "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "potins".* FROM "potins"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
  	@id = params[:id]
  	@city = City.find(@id)
  	@city_potins = Potin.all.select{ |p| p.user.city_id = @id }