app/controllers/pages_controller.rb

SELECT "potins".* FROM "potins"
---
	def accueil
		@potins = Potin.all