app/controllers/potins_controller.rb

SELECT "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
 		@potin = Potin.find(params[:id])
		@potin_title = @potin.title
		@potin_author_first_name = @potin.user.first_name

SELECT "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
  	if params[:id] = session[:id]
  		@potin = Potin.find(params[:id])

INSERT INTO "potins" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dfssf"], ["content", "hthgjhgtrfezsrfgtjhkhhgftrds bbhjhgrfd"], ["user_id", 11], ["created_at", "2020-10-29 21:45:38.615037"], ["updated_at", "2020-10-29 21:45:38.615037"]]
---
  def create
		@potin = Potin.new('title' => params[:title], 'content' => params[:content], 'user_id' => session[:user_id])

		if (@potin.save)

SELECT "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "potins" SET "content" = $1, "updated_at" = $2 WHERE "potins"."id" = $3  [["content", "Sed repudiandae id voluptas.sdfsdfddffsdsfd"], ["updated_at", "2020-10-29 21:53:30.791572"], ["id", 11]]
---
  def update
  	@potin = Potin.find(params[:id])
  	if @potin.user_id = session[:user_id] && @potin.update(potin_params)

SELECT "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "potins" WHERE "potins"."id" = $1  [["id", 21]]
---
  def destroy
  	@potin = Potin.find(params[:id])
  	if @potin.user_id = session[:user_id]
  		@potin.destroy