app/controllers/users_controller.rb

  def show
  	@id = params[:id]
  	@user = User.find(@id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
  	user = User.new('first_name' => params[:first_name], 'last_name' => params[:last_name], 'description' => params[:description], 'email' => params[:email], 'age' => params[:age].to_i, 'password' => params[:password], 'city_id' => params[:city_id])

  	if (user.save)
---
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "password_digest", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"