app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def user
  	@id = params[:id]
  	@user = User.find(@id)