app/models/user.rb

UPDATE "users" SET "remember_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["remember_digest", "$2a$12$kyQbFdZpuJFrQo1UOXpDGO7mjfTJoV0rAb.x5i//RtCbW298jr4Vi"], ["updated_at", "2020-10-30 22:45:46.303777"], ["id", 11]]
---
	def remember(remember_token)
    remember_digest = BCrypt::Password.create(remember_token)
    self.update(remember_digest: remember_digest)